Revit 2024 API
BuiltInFailures.RegenFailures.CircularDependencyUncutError Property
 There is a circular chain of references among the highlighted elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircularDependencyUncutError { get; }
Visual Basic
Public Shared ReadOnly Property CircularDependencyUncutError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircularDependencyUncutError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RegenFailures Class
Autodesk.Revit.DB Namespace